tutorials/Ti_Validation/2D_Ti_95_156/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.10                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(


    (-5 -200 -100)//0
    (5 -200 -100)//1
    (5 400 -100)//2
    (-5 400 -100)//3
    (-5 -200 500)//4
    (5 -200 500)//5
    (5 400 500)//6
    (-5 400 500)//7



);
blocks
(
    hex (0 1 2 3 4 5 6 7) (1 240 240) simpleGrading (1 1 1)		//REGION 1



);

edges
(
);

boundary
(

    lowerWall
    {
        type wall;
        faces
        (
            (3 7 6 2)

        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    rightWall
    {
        type empty;
        faces
        (
            (1 2 6 5)
	    
        );
    }
    leftWall
    {
        type empty;
        faces
        (
            (0 4 7 3)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (0 3 2 1)
	    (5 6 7 4)
        );
    }
);

mergePatchPairs
(


);

// ************************************************************************* //
