tutorials/Ti_Validation/2D_Ti_95_156/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.metal 0
);

regions
(



    boxToCell
    {
        box (-200e-6 0.1e-6 -0.5) (200e-6 500.1e-6 0.5);
        fieldValues
        (
    volScalarFieldValue alpha.metal 1
        );
    }

/*
cylinderToCell
{
p1 	 (-1 	 0.0005 	 0.0);
p2 	 (51 	 0.0005 	 0.0);
radius 5e-4;
fieldValues
(
            volScalarFieldValue alpha.phase1 1
);
}

cylinderToCell
{
p1 	 (-1 	 0.0005 	 -1e-3);
p2 	 (51 	 0.0005 	 -1e-3);
radius 5e-4;
fieldValues
(
            volScalarFieldValue alpha.phase1 1
);
}
cylinderToCell
{
p1 	 (-1 	 0.0005 	 1e-3);
p2 	 (51 	 0.0005 	 1e-3);
radius 5e-4;
fieldValues
(
            volScalarFieldValue alpha.phase1 1
);
}

cylinderToCell
{
p1 	 (-1 	 0.000 	 2.5e-3);
p2 	 (51 	 0.000 	 2.5e-3);
radius 10e-4;
fieldValues
(
            volScalarFieldValue alpha.phase1 1
);
}

cylinderToCell
{
p1 	 (-1 	 0.0005 	 4e-3);
p2 	 (51 	 0.0005 	 4e-3);
radius 5e-4;
fieldValues
(
            volScalarFieldValue alpha.phase1 1
);
}

cylinderToCell
{
p1 	 (-1 	 0.0005 	 6e-3);
p2 	 (51 	 0.0005 	 6e-3);
radius 5e-4;
fieldValues
(
            volScalarFieldValue alpha.phase1 1
);
}
*/

);


// ************************************************************************* //
